while True:
    count = 0
    answer = input("Яка планета найбільша в Сонячній системі? а. Земля б. Сатурн в. Юпітер ")
    if answer == "Юпітер":
        count += 1
        print("Молодець правильно")
    print("Далі")
    answer = input("Хто написав «Кобзар»? а. Іван Франко б. Тарас Шевченко в. Леся Українка ")
    if answer == "Тарас Шевченко":
        count += 1
        print("Молодець правильно")
    print("Далі")
    answer = input("Який материк найбільший за площею? а. Європа б. Азія в. Африка ")
    if answer == "Азія":
        count += 1
        print("Молодець правильно")
    answer = input("Яке море є найсолонішим у світі? а. Чорне б. Червоне в. Мертве ")
    if answer == "Мертве":
        count += 1
        print("Молодець правильно")
    answer = input("Яка річка найдовша в Україні? а. Південний Буг б. Тиса в. Дніпро ")
    if answer == "Дніпро":
        count += 1
        print("Молодець правильно")
    print(f"Правильних відповідей: {count}")
    break
